mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/lib/sdk11/components/libraries/bootloader_dfu/dfu_transport_ble.c
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
          // Tell SoftDevice to choose PHY automatically
          ble_gap_phys_t phy = { BLE_GAP_PHY_AUTO, BLE_GAP_PHY_AUTO };
          (void) sd_ble_gap_phy_update(m_conn_handle, &phy);
        }
        break;

        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
        {
          uint16_t att_mtu = MIN(p_ble_evt->evt.gatts_evt.params.exchange_mtu_request.client_rx_mtu, BLEGATT_ATT_MTU_MAX);

          // Choose the largest <= requested MTU whose ATT payload is word-aligned.
          att_mtu = ((att_mtu - 3U) & 0xFFFCU) + 3U;

          PRINTF("GAP ATT MTU is changed to %d\r\n", att_mtu);
          APP_ERROR_CHECK( sd_ble_gatts_exchange_mtu_reply(m_conn_handle, att_mtu) );
        }
        break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief     Function for dispatching a S110 SoftDevice event to all modules with a S110
 *            SoftDevice event handler.
 *
 * @details   This function is called from the S110 SoftDevice event interrupt handler after a
 *            S110 SoftDevice event has been received.
 *
 * @param[in] p_ble_evt S110 SoftDevice event.
 */
/*static*/ void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    ble_dfu_on_ble_evt(&m_dfu, p_ble_evt);
    on_ble_evt(p_ble_evt);
}

/**@brief     Function for the GAP initialization.
 *
 * @details   This function will setup all the necessary GAP (Generic Access Profile) parameters of
 *            the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *)DEVICE_NAME, strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief     Function for handling Service errors.
 *
 * @details   A pointer to this function will be passed to the DFU service which may need to inform
 *            the application about an error.
 *
 * @param[in] nrf_error Error code containing information about what went wrong.
 */
static void service_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


static void dis_string_add(uint16_t service_handle,
                           uint16_t uuid,
                           char const * p_string,
                           uint16_t length)
{
    ble_gatts_char_md_t char_md = {0};
    char_md.char_props.read = 1;

    ble_gatts_attr_md_t attr_md = {0};
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&attr_md.write_perm);
    attr_md.vloc = BLE_GATTS_VLOC_STACK;

    ble_uuid_t value_uuid = {
        .uuid = uuid,
        .type = BLE_UUID_TYPE_BLE,
    };
    ble_gatts_attr_t value = {
        .p_uuid = &value_uuid,
        .p_attr_md = &attr_md,
        .init_len = length,
        .max_len = length,
        .p_value = (uint8_t *)p_string,
    };
    ble_gatts_char_handles_t handles;
    APP_ERROR_CHECK(sd_ble_gatts_characteristic_add(service_handle, &char_md,
                                                     &value, &handles));
}

static void device_information_init(void)
{
    ble_uuid_t service_uuid = {
        .uuid = BLE_UUID_DEVICE_INFORMATION_SERVICE,
        .type = BLE_UUID_TYPE_BLE,
    };
    uint16_t service_handle;
    APP_ERROR_CHECK(sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
                                              &service_uuid,
                                              &service_handle));

    // Preserve the historical attribute order. Bonded phones and BlueZ cache
    // these value handles: manufacturer 0x0018, model 0x001A, firmware 0x001C.
    dis_string_add(service_handle, BLE_UUID_MANUFACTURER_NAME_STRING_CHAR,
                   BLEDIS_MANUFACTURER, sizeof(BLEDIS_MANUFACTURER) - 1U);
    dis_string_add(service_handle, BLE_UUID_MODEL_NUMBER_STRING_CHAR,
                   BLEDIS_MODEL, sizeof(BLEDIS_MODEL) - 1U);
    dis_string_add(service_handle, BLE_UUID_FIRMWARE_REVISION_STRING_CHAR,
                   BLEDIS_FW_VERSION, sizeof(BLEDIS_FW_VERSION) - 1U);
}

/**@brief     Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t       err_code;
    ble_dfu_init_t dfu_init_obj;

    // Initialize the Device Firmware Update Service.
    memset(&dfu_init_obj, 0, sizeof(dfu_init_obj));

    dfu_init_obj.revision      = DFU_REVISION;
    dfu_init_obj.evt_handler   = on_dfu_evt;
    dfu_init_obj.error_handler = service_error_handler;

    err_code = ble_dfu_init(&m_dfu, &dfu_init_obj);
    APP_ERROR_CHECK(err_code);

    // Keep the legacy DIS attribute layout stable for bonded/cacheing clients.
    device_information_init();

}


/**@brief Function for initializing security parameters.
 */
static void sec_params_init(void)
{
    m_sec_params.bond         = SEC_PARAM_BOND;
    m_sec_params.mitm         = SEC_PARAM_MITM;
    m_sec_params.lesc         = SEC_PARAM_LESC;
    m_sec_params.keypress     = SEC_PARAM_KEYPRESS;
    m_sec_params.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    m_sec_params.oob          = SEC_PARAM_OOB;
    m_sec_params.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    m_sec_params.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
}


uint32_t dfu_transport_ble_update_start(void)
{
    uint32_t err_code;

    m_accum_len = 0;
    m_accum_active = false;
    m_num_of_firmware_bytes_rcvd = 0;
    m_reported_image_size = 0;
    mp_final_packet = NULL;

    m_tear_down_in_progress = false;
    m_pkt_type              = PKT_TYPE_INVALID;
    m_ble_data_policy_active = false;

    dfu_register_callback(dfu_cb_handler);

    err_code = hci_mem_pool_open();
    VERIFY_SUCCESS(err_code);

    err_code = dfu_ble_peer_data_get(&m_ble_peer_data);
    if (err_code == NRF_SUCCESS)
    {
        m_ble_peer_data_valid = true;
    }
    else
    {
        ble_gap_addr_t addr;

